%% @copyright 2013-2015 DWANGO Co., Ltd. All Rights Reserved.
%%
%% @doc `inet'の拡張ライブラリ
-module(moyo_inet).

%%----------------------------------------------------------------------------------------------------------------------
%% Exported API
%%----------------------------------------------------------------------------------------------------------------------

-export([
         find_free_port/0
        ]).

%%----------------------------------------------------------------------------------------------------------------------
%% Exported Functions
%%----------------------------------------------------------------------------------------------------------------------

%% @doc 現在空いているポートを1つ返す
%%
%% この関数を呼び出した際の空きポートを返す為, そのポートが他のアプリケーションによって使用されてしまい, 使えない可能性がある.
-spec find_free_port() -> {ok, inet:port_number()} | {error, Reason :: term()}.
find_free_port() ->
    case gen_tcp:listen(0, []) of
        {ok, Socket} ->
            case inet:port(Socket) of
                {ok, Port} -> gen_tcp:close(Socket), {ok, Port};
                Err        -> Err
            end;
        Err -> Err
    end.
